{
  "model_path": "tokenizer/nova_tokenizer.model",
  "vocab_size": 1000,
  "special_tokens": [
    "<pad>",
    "<s>",
    "</s>",
    "<unk>",
    "<|code|>",
    "<|endcode|>",
    "<|python|>",
    "<|cpp|>",
    "<|javascript|>",
    "<|java|>",
    "<|rust|>",
    "<|bash|>",
    "<|sql|>",
    "<|human|>",
    "<|assistant|>",
    "<|system|>",
    "<|endoftext|>",
    "<|debug|>",
    "<|fix|>",
    "<|explain|>",
    "<|lumina|>"
  ],
  "special_token_ids": {
    "<pad>": 0,
    "<s>": 1,
    "</s>": 2,
    "<unk>": 3,
    "<|code|>": 4,
    "<|endcode|>": 5,
    "<|python|>": 6,
    "<|cpp|>": 7,
    "<|javascript|>": 8,
    "<|java|>": 9,
    "<|rust|>": 10,
    "<|bash|>": 11,
    "<|sql|>": 12,
    "<|human|>": 13,
    "<|assistant|>": 14,
    "<|system|>": 15,
    "<|endoftext|>": 16,
    "<|debug|>": 17,
    "<|fix|>": 18,
    "<|explain|>": 19,
    "<|lumina|>": 20
  }
}